Revit 2024 API
BuiltInFailures.SketchFailures.ConvertSplineToLineFailed Property
 Failed to convert spline to straight line
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConvertSplineToLineFailed { get; }
Visual Basic
Public Shared ReadOnly Property ConvertSplineToLineFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConvertSplineToLineFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace